src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Содержит сотрудников на определенных должностях в структурных единицах.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается действительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается недействительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Занимаемая сотрудником должность.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВДокументах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПереписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ЗащитаПерсональныхДанныхДокументооборот/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

#Область УничтожениеПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// Физические лица
	МетаданныеФизическиеЛица = Метаданные.Справочники.ФизическиеЛица;
	СтандартныеРеквизиты = МетаданныеФизическиеЛица.СтандартныеРеквизиты;
	Ресурсы = МетаданныеФизическиеЛица.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеФизическиеЛица.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Ресурсы.ДатаРождения.ПолноеИмя());
	Поля.Добавить(Ресурсы.ФайлФотографии.ПолноеИмя());
	Поля.Добавить(Ресурсы.ИНН.ПолноеИмя());
	Поля.Добавить(Ресурсы.Пол.ПолноеИмя());
	Поля.Добавить(Ресурсы.СтраховойНомерПФР.ПолноеИмя());
	Поля.Добавить(Метаданные.ОбщиеРеквизиты.НаименованиеЯзык1.ПолноеИмя());
	Поля.Добавить(Метаданные.ОбщиеРеквизиты.НаименованиеЯзык2.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация физических лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	// История ФИО Физических лиц
	МетаданныеФИОФизическихЛиц = Метаданные.РегистрыСведений.ФИОФизическихЛиц;
	СтандартныеРеквизиты = МетаданныеФИОФизическихЛиц.СтандартныеРеквизиты;
	Ресурсы = МетаданныеФИОФизическихЛиц.Ресурсы;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФИОФизическихЛиц.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеФИОФизическихЛиц.Измерения.ФизическоеЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(Ресурсы.ФИО.ПолноеИмя());
	Поля.Добавить(Ресурсы.ФИОЯзык1.ПолноеИмя());
	Поля.Добавить(Ресурсы.ФИОЯзык2.ПолноеИмя()); 
	Поля.Добавить(Ресурсы.ИменительныйПадеж.ПолноеИмя());
	Поля.Добавить(Ресурсы.РодительныйПадеж.ПолноеИмя());
	Поля.Добавить(Ресурсы.ВинительныйПадеж.ПолноеИмя());
	Поля.Добавить(Ресурсы.ДательныйПадеж.ПолноеИмя());
	Поля.Добавить(Ресурсы.ТворительныйПадеж.ПолноеИмя());
	Поля.Добавить(Ресурсы.ПредложныйПадеж.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Справочник Контрагенты по реквизиту ФизЛицо
	МетаданныеКонтрагенты = Метаданные.Справочники.Контрагенты;
	СтандартныеРеквизиты = МетаданныеКонтрагенты.СтандартныеРеквизиты;
	Ресурсы = МетаданныеКонтрагенты.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеКонтрагенты.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтрагенты.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеКонтрагенты.Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Ресурсы.НаименованиеПолное.Имя);
	Поля.Добавить(Метаданные.ОбщиеРеквизиты.НаименованиеЯзык1.ПолноеИмя());
	Поля.Добавить(Метаданные.ОбщиеРеквизиты.НаименованиеЯзык2.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация контрагентов
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтрагенты.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеКонтрагенты.Реквизиты.ФизЛицо.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	
	// Справочник Контактные лица по реквизиту ФизЛицо
	МетаданныеКонтактныеЛица = Метаданные.Справочники.КонтактныеЛица;
	СтандартныеРеквизиты = МетаданныеКонтактныеЛица.СтандартныеРеквизиты;
	Ресурсы = МетаданныеКонтактныеЛица.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтактныеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Ресурсы.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	ЭлементПДн.Поля = Поля;

	// Контактная информация контактных лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтактныеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Ресурсы.ФизЛицо.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);


	
	// Регистр сведений «Документы физических лиц».
	МетаданныеДокументыФизЛиц = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ДокументыФизЛицРесурсы = МетаданныеДокументыФизЛиц.Ресурсы;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеДокументыФизЛиц.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеДокументыФизЛиц.Измерения.Физлицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ДокументыФизЛицРесурсы.Серия.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.Номер.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.ДатаВыдачи.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.СрокДействия.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.КемВыдан.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.КодПодразделения.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.Представление.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.УдалитьВидДокумента.Имя);
	ЭлементПДн.Поля = Поля;
	
	
	
	// Пользователи по реквизиту «ФизЛицо»
	МетаданныеПользователи = Метаданные.Справочники.Пользователи;
	СтандартныеРеквизиты = МетаданныеПользователи.СтандартныеРеквизиты;
	Ресурсы = МетаданныеПользователи.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеПользователи.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеПользователи.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Ресурсы.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Ресурсы.ПредставлениеВДокументах.ПолноеИмя());
	Поля.Добавить(Ресурсы.ПредставлениеВПереписке.ПолноеИмя());
	Поля.Добавить(Ресурсы.ПредставлениеВПерепискеСРангом.ПолноеИмя());
	Поля.Добавить(Ресурсы.Фотография.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация пользователей
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеПользователи.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);



	// Сотрудники по владельцу
	МетаданныеСотрудники = Метаданные.Справочники.Сотрудники;
	СтандартныеРеквизиты = МетаданныеСотрудники.СтандартныеРеквизиты;
	Ресурсы = МетаданныеСотрудники.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеСотрудники.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеСотрудники.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Владелец.Имя;
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Ресурсы.ПредставлениеВДокументах.ПолноеИмя());
	Поля.Добавить(Ресурсы.ПредставлениеВПереписке.ПолноеИмя());
	Поля.Добавить(Метаданные.ОбщиеРеквизиты.НаименованиеЯзык1.ПолноеИмя());
	Поля.Добавить(Метаданные.ОбщиеРеквизиты.НаименованиеЯзык2.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация пользователей
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеСотрудники.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);

	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередСкрытиемПерсональныхДанныхСубъектов
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия) Экспорт
	
	СубъектыФизЛица = ОбщегоНазначенияДокументооборотКлиентСервер.ЭлементыМассиваЗаданногоТипа(Субъекты,
		Тип("СправочникСсылка.ФизическиеЛица"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		|	Сотрудники.Владелец
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Владелец В (&Субъекты)
		|	И Сотрудники.Действует";
	Запрос.УстановитьПараметр("Субъекты", СубъектыФизЛица);
	ДействующиеСотрудникиВыборка = Запрос.Выполнить().Выбрать();
	
	Пока ДействующиеСотрудникиВыборка.Следующий() Цикл
		
		НовоеИсключение = ТаблицаИсключений.Добавить();
		НовоеИсключение.Субъект = ДействующиеСотрудникиВыборка.Владелец;
		НовоеИсключение.ПричинаОтменыУничтожения = НСтр("ru = 'Субъект персональных данных является действующим сотрудником.'");
		
		ОтказОтСкрытия = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередУничтожениемПерсональныхДанных
Процедура ПередУничтожениемПерсональныхДанных(Объект, Субъекты, ВыполнитьЗаписьОбъекта) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Сотрудники") Тогда
		Объект.ДополнительныеСвойства.Вставить(
			"ПараметрыОбновленияДанныхКэширующихОбъектов",
			Справочники.Сотрудники.ЗначенияПараметровОбновленияДанныхКэширующихОбъектов(Объект));
	КонецЕсли;

	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
		
		ПараметрыОбработкиПользователяИБ = Новый Структура;
		
		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Ложь);
		ОписаниеПользователяИБ.Вставить("Имя", Объект.Наименование);
		ОписаниеПользователяИБ.Вставить("АдресЭлектроннойПочты",
			УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				Объект, Справочники.ВидыКонтактнойИнформации.EmailПользователя));
		
		Объект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);

		ПользователиСлужебный.НачатьОбработкуПользователяИБ(Объект, ПараметрыОбработкиПользователяИБ);
		Объект.ДополнительныеСвойства.Вставить("ПараметрыОбработкиПользователяИБ", ПараметрыОбработкиПользователяИБ);
		
	КонецЕсли;

КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПослеУничтоженияПерсональныхДанных
Процедура ПослеУничтоженияПерсональныхДанных(Объект, Субъекты) Экспорт

	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Сотрудники") Тогда
		ПараметрыОбновления = Объект.ДополнительныеСвойства.ПараметрыОбновленияДанныхКэширующихОбъектов; // Структура
		Справочники.Сотрудники.ОбновитьДанныеКэширующихОбъектов(
			Объект, ПараметрыОбновления);
	КонецЕсли;

	// еще надо чистить почту для восстановления пароля
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
		ПараметрыОбработкиПользователяИБ = Объект.ДополнительныеСвойства.ПараметрыОбработкиПользователяИБ; // Структура
		ПользователиСлужебный.ЗавершитьОбработкуПользователяИБ(
			Объект, ПараметрыОбработкиПользователяИБ);
	КонецЕсли;

КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриРасчетеСроковХраненияПерсональныхДанных
Процедура ПриРасчетеСроковХраненияПерсональныхДанных(ДанныеСубъектов, СрокиХранения) Экспорт

	// Рассчитываем срок хранения ПДн с учетом наличия согласий на обработку
	// Если есть согласие, и в нем указан срок, берем этот срок. Если срок не указан - храним бессрочно.
	// Если после согласия есть отзыв, берем срок из него.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Субъект,
		|	&ДатаНеУничтожать КАК СрокХранения
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласияНаОбработкуПерсональныхДанных.СрезПоследних(, Субъект В (&Субъекты)) КАК
		|			СогласияНаОбработкуПерсональныхДанныхСрезПоследних
		|		ПО (ФизическиеЛица.Ссылка = СогласияНаОбработкуПерсональныхДанныхСрезПоследних.Субъект)
		|ГДЕ
		|	ФизическиеЛица.Ссылка В (&Субъекты)
		|	И СогласияНаОбработкуПерсональныхДанныхСрезПоследних.Субъект ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Субъекты", ДанныеСубъектов.ВыгрузитьКолонку("Субъект"));
	Запрос.УстановитьПараметр("ДатаНеУничтожать", ДатаНеУничтожать());
	
	ФизлицаИСрокиХранения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ФизлицаИСрокиХранения Цикл
	
		НоваяСтрока = СрокиХранения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;

КонецПроцедуры

// См. ЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных
Процедура ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати) Экспорт
	
	Если Не ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.СогласиеНаОбработкуПерсональныхДанных) Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоступаКПерсональнымДанным") Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СогласиеНаОбработкуПерсональныхДанных";
	КомандаПечати.Представление = НСтр("ru = 'Согласие на обработку ПДн...'");
	КомандаПечати.Обработчик = "ЗащитаПерсональныхДанныхКлиент.ОткрытьФормуСогласиеНаОбработкуПерсональныхДанных";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн)
	
	Поля = Новый Массив; // Массив из Строка 
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.ЗначенияПолей.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Значение.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Представление.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.АдресЭП.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефона.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефонаБезКодов.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "КонтактнаяИнформация";
	
КонецПроцедуры

// Возвращаемое значение:
//  Дата
Функция ДатаНеУничтожать() Экспорт
	
	Возврат Дата(3999, 12, 31);
	
КонецФункции

#КонецОбласти
